NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK82F25615.svd
        <register>
          <name>LTC0_PKB1_14</name>
          <description>LTC PKHA B1 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_30</name>
          <description>LTC PKHA B 30 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB1_15</name>
          <description>LTC PKHA B1 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B1</name>
              <description>B1 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_31</name>
          <description>LTC PKHA B 31 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_0</name>
          <description>LTC PKHA B2 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_32</name>
          <description>LTC PKHA B 32 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_1</name>
          <description>LTC PKHA B2 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_33</name>
          <description>LTC PKHA B 33 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_2</name>
          <description>LTC PKHA B2 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_34</name>
          <description>LTC PKHA B 34 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_3</name>
          <description>LTC PKHA B2 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_35</name>
          <description>LTC PKHA B 35 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_4</name>
          <description>LTC PKHA B2 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_36</name>
          <description>LTC PKHA B 36 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_5</name>
          <description>LTC PKHA B2 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_37</name>
          <description>LTC PKHA B 37 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_6</name>
          <description>LTC PKHA B2 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_38</name>
          <description>LTC PKHA B 38 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_7</name>
          <description>LTC PKHA B2 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_39</name>
          <description>LTC PKHA B 39 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xA9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_8</name>
          <description>LTC PKHA B2 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_40</name>
          <description>LTC PKHA B 40 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_9</name>
          <description>LTC PKHA B2 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_41</name>
          <description>LTC PKHA B 41 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_10</name>
          <description>LTC PKHA B2 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_42</name>
          <description>LTC PKHA B 42 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_11</name>
          <description>LTC PKHA B2 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_43</name>
          <description>LTC PKHA B 43 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_12</name>
          <description>LTC PKHA B2 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_44</name>
          <description>LTC PKHA B 44 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_13</name>
          <description>LTC PKHA B2 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_45</name>
          <description>LTC PKHA B 45 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_14</name>
          <description>LTC PKHA B2 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_46</name>
          <description>LTC PKHA B 46 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB2_15</name>
          <description>LTC PKHA B2 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xABC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B2</name>
              <description>B2 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_47</name>
          <description>LTC PKHA B 47 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xABC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_0</name>
          <description>LTC PKHA B3 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_48</name>
          <description>LTC PKHA B 48 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_1</name>
          <description>LTC PKHA B3 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_49</name>
          <description>LTC PKHA B 49 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_2</name>
          <description>LTC PKHA B3 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_50</name>
          <description>LTC PKHA B 50 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_3</name>
          <description>LTC PKHA B3 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xACC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_51</name>
          <description>LTC PKHA B 51 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xACC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_4</name>
          <description>LTC PKHA B3 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_52</name>
          <description>LTC PKHA B 52 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
