NDJSec/FALCON/knowledge_base/svd/data/Freescale/MK82F25615.svd
        <register>
          <name>LTC0_PKB3_5</name>
          <description>LTC PKHA B3 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_53</name>
          <description>LTC PKHA B 53 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_6</name>
          <description>LTC PKHA B3 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_54</name>
          <description>LTC PKHA B 54 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_7</name>
          <description>LTC PKHA B3 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xADC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_55</name>
          <description>LTC PKHA B 55 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xADC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_8</name>
          <description>LTC PKHA B3 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_56</name>
          <description>LTC PKHA B 56 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_9</name>
          <description>LTC PKHA B3 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_57</name>
          <description>LTC PKHA B 57 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_10</name>
          <description>LTC PKHA B3 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_58</name>
          <description>LTC PKHA B 58 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_11</name>
          <description>LTC PKHA B3 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_59</name>
          <description>LTC PKHA B 59 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_12</name>
          <description>LTC PKHA B3 12 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_60</name>
          <description>LTC PKHA B 60 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_13</name>
          <description>LTC PKHA B3 13 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_61</name>
          <description>LTC PKHA B 61 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_14</name>
          <description>LTC PKHA B3 14 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_62</name>
          <description>LTC PKHA B 62 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKB3_15</name>
          <description>LTC PKHA B3 15 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_B3</name>
              <description>B3 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKB_63</name>
          <description>LTC PKHA B 63 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xAFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_0</name>
          <description>LTC PKHA N0 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_0</name>
          <description>LTC PKHA N 0 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_1</name>
          <description>LTC PKHA N0 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_1</name>
          <description>LTC PKHA N 1 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_2</name>
          <description>LTC PKHA N0 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_2</name>
          <description>LTC PKHA N 2 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_3</name>
          <description>LTC PKHA N0 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_3</name>
          <description>LTC PKHA N 3 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_4</name>
          <description>LTC PKHA N0 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_4</name>
          <description>LTC PKHA N 4 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_5</name>
          <description>LTC PKHA N0 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_5</name>
          <description>LTC PKHA N 5 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_6</name>
          <description>LTC PKHA N0 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_6</name>
          <description>LTC PKHA N 6 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_7</name>
          <description>LTC PKHA N0 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_7</name>
          <description>LTC PKHA N 7 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_8</name>
          <description>LTC PKHA N0 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_8</name>
          <description>LTC PKHA N 8 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_9</name>
          <description>LTC PKHA N0 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_9</name>
          <description>LTC PKHA N 9 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_10</name>
          <description>LTC PKHA N0 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_10</name>
          <description>LTC PKHA N 10 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LTC0_PKN0_11</name>
          <description>LTC PKHA N0 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_N0</name>
              <description>N0 VALUE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LTC0_PKN_11</name>
          <description>LTC PKHA N 11 Register</description>
          <alternateGroup>LTC0</alternateGroup>
          <addressOffset>0xC2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
